app/controllers/feedbacks_controller.rb

  def index
    @feedbacks = Feedback.all
---
SELECT * FROM "feedbacks"

  def show
    @feedback = Feedback.find(params[:id])
---
SELECT * FROM "feedbacks" WHERE ("feedbacks"."id" = 1)

  def edit
    @feedback = Feedback.find(params[:id])
---
SELECT * FROM "feedbacks" WHERE ("feedbacks"."id" = 1)

  def create
    @feedback = Feedback.new(params[:feedback])

    respond_to do |format|
      if @feedback.save
---
INSERT INTO "feedbacks" ("title", "content", "email", "created_at", "updated_at", "user_name") VALUES(NULL, NULL, NULL, '2013-01-21 15:10:31', '2013-01-21 15:10:31', NULL)