app/controllers/gadgets_controller.rb

SELECT "gadgets".* FROM "gadgets" WHERE (categoryid=1) LIMIT 1
---
  def index
    @gadgets = Gadget.find(
      :all,
      :order => "updated_at DESC",
      :limit => 20)