app/controllers/gadgets_controller.rb

SELECT "gadgets".* FROM "gadgets" ORDER BY updated_at DESC LIMIT 20
---
  def index
    @gadgets = Gadget.order("updated_at DESC").limit(20)

SELECT "gadgets".* FROM "gadgets" WHERE "gadgets"."id" = ? LIMIT 1  [["id", "index"]]
---
  def show
    id = params[:id]
    @gadget = Gadget.find(id)

SELECT * FROM "gadgets" WHERE (categoryid=1) LIMIT 1
SELECT * FROM "categories" ORDER BY id
---
  def edit
    @gadget = Gadget.find(params[:id])

    @allCategories = Category.order(id: :ASC).all.map{|u| [u.name, u.id]}

INSERT INTO "gadgets" ("created_at", "title", "lastupdatetime", "updated_at", "creatdatetime", "categoryid", "content", "author_id") VALUES('2011-12-18 15:11:35', 'xiaomishouji', '2011-12-18 15:11:35', '2011-12-18 15:11:35', '2011-12-18 15:11:35', 1, '<div class="artInfo"><span id="art_source"><a href="http://www.sina.com.cn/">http://www.sina.com.cn</a></span>&nbsp;&nbsp;<span id="pub_date">2011年12月18日&nbsp;08:52</span>&nbsp;&nbsp;<span id="media_name"><a target="_blank" href="http://tech.sina.com.cn/">新浪科技</a></span><a href="http://weibo.com/sinatech?zwm=tech" class="weibo-card-dropdown" id="media_weibo">微博</a></div>
---
  def create
    @gadget = Gadget.new(params[:gadget])

    # set the default datetime value.
    @gadget.creatdatetime = DateTime.now
    @gadget.lastupdatetime = DateTime.now

    respond_to do |format|
      if @gadget.save

SELECT * FROM "gadgets" WHERE ("gadgets"."id" = 10)
UPDATE "gadgets" SET "updated_at" = '2011-03-26 09:00:31', "content" = '<p><strong>asdf</strong>asdfas<strong>dfasdfas</strong>dfasdfasdf<img src="http://localhost:3000/uploaded/1-100R6223536.jpg" alt="" /></p>' WHERE "id" = 8
---
  def update
    @gadget = Gadget.find(params[:id])

    isSuccess = @gadget.update_attributes(params[:gadget])

SELECT * FROM "gadgets" WHERE ("gadgets"."id" = 1)
DELETE FROM "gadgets" WHERE "id" = 1
---
  def destroy
    @gadget = Gadget.find(params[:id])
    @gadget.destroy

SELECT * FROM "gadgets" WHERE ("gadgets"."id" = 3)
INSERT INTO "comments" ("created_at", "updated_at", "repliedcomments", "gadget_id", "content", "author_id") VALUES('2011-03-20 04:16:59', '2011-03-20 04:16:59', NULL, 3, 'asdfasdf', 0)
---
  def add_comment
    @gadget = Gadget.find(params[:id])
    @comment = Comment.new(params[:comment])

     @comment.gadget_id = @gadget.id

     @comment.save!